In [2]:
# importing libaries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
ls

01_airbnb_exploratory_data_analysis.ipynb

## Load Datasets

In [4]:
# load csv
df_1 = pd.read_csv('../data/airnb.csv')
df_2 = pd.read_csv('../data/airnb_desert.csv', encoding="cp1252")
df_3 = pd.read_csv('../data/airnb_luxe.csv', encoding="cp1252")

## Inspecting Dataset

In [5]:
print(f"1. airnb.csv columns: {list(df_1.columns)}")
print(f"2. airnb_desert.csv columns: {list(df_2.columns)}")
print(f"3. airnb_luxe.csv columns: {list(df_3.columns)}")

1. airnb.csv columns: ['Title', 'Detail', 'Date', 'Price(in dollar)', 'Offer price(in dollar)', 'Review and rating', 'Number of bed']
2. airnb_desert.csv columns: ['Desert name', 'Date', 'Price(In dollar)', 'Details', 'Rating']
3. airnb_luxe.csv columns: ['Luxe name', 'Date', 'Price(In dollar)', 'Distance']

In [6]:
print(f"1. airnb.csv size: rows {df_1.shape[0]} and {df_1.shape[1]} columns")
print(f"2. airnb_desert.csv size: rows {df_2.shape[0]} and {df_2.shape[1]} columns")
print(f"3. airnb_luxe.csv size: rows {df_3.shape[0]} and {df_3.shape[1]} columns")

1. airnb.csv size: rows 953 and 7 columns
2. airnb_desert.csv size: rows 280 and 5 columns
3. airnb_luxe.csv size: rows 280 and 4 columns

In [7]:
df_1.dtypes

Title                     object
Detail                    object
Date                      object
Price(in dollar)          object
Offer price(in dollar)    object
Review and rating         object
Number of bed             object
dtype: object

In [8]:
df_2.dtypes

Desert name          object
Date                 object
Price(In dollar)     object
Details              object
Rating              float64
dtype: object

In [9]:
df_3.dtypes

Luxe name           object
Date                object
Price(In dollar)    object
Distance            object
dtype: object

## Handeling Null Values

In [10]:
# create a function to find columns with nulls
def null_columns(dataframe):
    has_null_list = []
    for i in range(len(dataframe.columns)):
        is_null = bool(dataframe[dataframe.columns[i]].isnull().any()) # checking to see if column has any null values
        if is_null == True:
            column_name = dataframe.columns[i]
            has_null_list.append(column_name)
    return has_null_list

In [11]:
# Apply function and print out results
first_function = null_columns(df_1)
second_function = null_columns(df_2)
third_function = null_columns(df_3)
print(first_function)
print(second_function)
print(third_function)

['Offer price(in dollar)', 'Review and rating']
['Rating']
[]

In [12]:
# Sizes of csv files
df1_shape = df_1.shape[0]
df2_shape = df_2.shape[0]

In [13]:
# Size of null values
null_shape_1 = df_1[df_1['Offer price(in dollar)'].isnull()].shape[0]
null_shape_2 = df_1[df_1['Review and rating'].isnull()].shape[0]
null_shape_2_1 = df_2[df_2['Rating'].isnull()].shape[0]

In [14]:
# Print Message
print(f" Null values in the first csv file are {round(null_shape_1/df1_shape,2)*100}% of the total file with null being in '{first_function[0]}' column")
print(f" Null values in the first csv file are {round(null_shape_2/df2_shape,2)*100}% of the total file with null being in '{first_function[1]}' column")
print(f" Null values in the second csv file are {round(null_shape_2_1/df2_shape,2)*100}% of the total file with null being in '{second_function[0]}' column")

 Null values in the first csv file are 83.0% of the total file with null being in 'Offer price(in dollar)' column
 Null values in the first csv file are 2.0% of the total file with null being in 'Review and rating' column
 Null values in the second csv file are 40.0% of the total file with null being in 'Rating' column

In [15]:
# Drop null values
df_clean = df_1.dropna(subset = ['Offer price(in dollar)']).copy()

In [16]:
df_clean['Offer price(in dollar)'] = df_clean['Offer price(in dollar)'].apply(lambda x: str(x).replace(",","")).astype(float)

In [17]:
df_clean['Price(in dollar)'] = df_clean['Price(in dollar)'].apply(lambda x: str(x).replace(",","")).astype(float)

In [18]:
df_clean['Title'] = df_clean['Title'].astype(str)

In [19]:
df_clean.head()

,Title,Detail,Date,Price(in dollar),Offer price(in dollar),Review and rating,Number of bed
0,"Chalet in Skykomish, Washington, US",Sky Haus - A-Frame Cabin,Jun 11 - 16,306.0,229.0,4.85 (531),4 beds
1,"Cabin in Hancock, New York, US",The Catskill A-Frame - Mid-Century Modern Cabin,Jun 6 - 11,485.0,170.0,4.77 (146),4 beds
2,"Cabin in West Farmington, Ohio, US",The Triangle: A-Frame Cabin for your city retreat,Jul 9 - 14,119.0,522.0,4.91 (515),4 beds
3,"Home in Blue Ridge, Georgia, US",*Summer Sizzle* 5 Min to Blue Ridge* Pets* Hot...,Jun 11 - 16,192.0,348.0,4.94 (88),5 beds
4,"Treehouse in Grandview, Texas, US",Luxury Treehouse Couples Getaway w/ Peaceful V...,Jun 4 - 9,232.0,196.0,4.99 (222),1 queen bed

In [20]:
df_clean.dtypes

Title                      object
Detail                     object
Date                       object
Price(in dollar)          float64
Offer price(in dollar)    float64
Review and rating          object
Number of bed              object
dtype: object

In [27]:
df_clean.groupby("Date")["Date"].count()

Date
Aug 1 - 6         1
Aug 14 - 19       1
Aug 18 - 23       1
Aug 19 - 24       1
Aug 20 - 25       3
                 ..
Sep 2 - 7         1
Sep 26 - Oct 1    1
Sep 29 - Oct 4    1
Sep 3 - 10        1
Sep 5 - 10        1
Name: Date, Length: 72, dtype: int64

In [44]:
df_clean[['Start Date','End Date']] = df_clean["Date"].str.split(' - ',expand = True)

In [50]:
# df_clean = df_clean.drop(['Date Range 1','Date Range 2'],axis =1)

In [51]:
df_clean

,Title,Detail,Date,Price(in dollar),Offer price(in dollar),Review and rating,Number of bed,Start Date,End Date
0,"Chalet in Skykomish, Washington, US",Sky Haus - A-Frame Cabin,Jun 11 - 16,306.0,229.0,4.85 (531),4 beds,Jun 11,16
1,"Cabin in Hancock, New York, US",The Catskill A-Frame - Mid-Century Modern Cabin,Jun 6 - 11,485.0,170.0,4.77 (146),4 beds,Jun 6,11
2,"Cabin in West Farmington, Ohio, US",The Triangle: A-Frame Cabin for your city retreat,Jul 9 - 14,119.0,522.0,4.91 (515),4 beds,Jul 9,14
3,"Home in Blue Ridge, Georgia, US",*Summer Sizzle* 5 Min to Blue Ridge* Pets* Hot...,Jun 11 - 16,192.0,348.0,4.94 (88),5 beds,Jun 11,16
4,"Treehouse in Grandview, Texas, US",Luxury Treehouse Couples Getaway w/ Peaceful V...,Jun 4 - 9,232.0,196.0,4.99 (222),1 queen bed,Jun 4,9
...,...,...,...,...,...,...,...,...,...
828,Apartment in Houston,King Suite/Sky Lounge/Luxurious Experience.,May 1 - 6,108.0,148.0,4.85 (55),2 beds,May 1,6
829,Cabin in Sevierville,Few days left in May,May 1 - 6,286.0,112.0,4.98 (263),1 king bed,May 1,6
830,Cabin in Fountain Green,"Cozy Private Mountain Cabin on 1,000 acre prop...",May 1 - 6,186.0,103.0,4.96 (78),4 beds,May 1,6
882,Dome in El Prado,Geodesic Earth Dome,May 1 - 6,91.0,161.0,4.9 (953),2 beds,May 1,6
936,Condo in Sunny Isles Beach,BEAUTIFULL CONDO IN THE HEART OF SUNNY ISLES.,May 1 - 6,151.0,159.0,4.57 (225),3 beds,May 1,6

In [60]:
df_clean["Start Month"] = df_clean["Start Date"].str.split(" ",expand = True)[0]

In [61]:
df_clean.groupby(["Start Month"]).count()

,Title,Detail,Date,Price(in dollar),Offer price(in dollar),Review and rating,Number of bed,Start Date,End Date,Month
Start Month,,,,,,,,,,
Aug,12,12,12,12,12,12,12,12,12,12
Jan,1,1,1,1,1,1,1,1,1,1
Jul,25,25,25,25,25,25,25,25,25,25
Jun,101,101,101,101,101,101,101,101,101,101
May,12,12,12,12,12,12,12,12,12,12
Nov,1,1,1,1,1,1,1,1,1,1
Oct,4,4,4,4,4,4,4,4,4,4
Sep,10,10,10,10,10,10,10,10,10,10

In [62]:
# create month dictionary 
month_dict = {
    'Jan': 'January',
    'Feb': '',
    'Mar': '',
    'Apr': '',
    'May': 'May',
    'Jun': 'June',
    'Jul': 'July',
    'Aug': 'August',
    'Sep': 'September',
    'Oct': 'October',
    'Nov': 'November',
    'Dec': 'December',
}

In [63]:
df_clean["Start Month"] =df_clean["Start Month"].map(month_dict)

In [65]:
df_clean = df_clean.drop(['Month'],axis =1)

In [71]:
df_clean.groupby('End Month').count()

,Title,Detail,Date,Price(in dollar),Offer price(in dollar),Review and rating,Number of bed,Start Date,End Date,Start Month
End Month,,,,,,,,,,
10,8,8,8,8,8,8,8,8,8,8
11,6,6,6,6,6,6,6,6,6,6
12,5,5,5,5,5,5,5,5,5,5
13,9,9,9,9,9,9,9,9,9,9
14,10,10,10,10,10,10,10,10,10,10
15,5,5,5,5,5,5,5,5,5,5
16,15,15,15,15,15,15,15,15,15,15
17,8,8,8,8,8,8,8,8,8,8
18,3,3,3,3,3,3,3,3,3,3
19,2,2,2,2,2,2,2,2,2,2
21,1,1,1,1,1,1,1,1,1,1
23,4,4,4,4,4,4,4,4,4,4
24,2,2,2,2,2,2,2,2,2,2
25,3,3,3,3,3,3,3,3,3,3
26,2,2,2,2,2,2,2,2,2,2
27,1,1,1,1,1,1,1,1,1,1
28,3,3,3,3,3,3,3,3,3,3
30,3,3,3,3,3,3,3,3,3,3
31,2,2,2,2,2,2,2,2,2,2
6,26,26,26,26,26,26,26,26,26,26
7,5,5,5,5,5,5,5,5,5,5
8,12,12,12,12,12,12,12,12,12,12
9,18,18,18,18,18,18,18,18,18,18
Aug,1,1,1,1,1,1,1,1,1,1
Dec,1,1,1,1,1,1,1,1,1,1
Jul,5,5,5,5,5,5,5,5,5,5
Nov,3,3,3,3,3,3,3,3,3,3
Oct,2,2,2,2,2,2,2,2,2,2
Sep,1,1,1,1,1,1,1,1,1,1

In [70]:
df_clean["End Month"] = df_clean["End Date"].str.split(" ",expand = True)[0]

In [69]:
df_clean.head()

,Title,Detail,Date,Price(in dollar),Offer price(in dollar),Review and rating,Number of bed,Start Date,End Date,Start Month,End Month
0,"Chalet in Skykomish, Washington, US",Sky Haus - A-Frame Cabin,Jun 11 - 16,306.0,229.0,4.85 (531),4 beds,Jun 11,16,June,16
1,"Cabin in Hancock, New York, US",The Catskill A-Frame - Mid-Century Modern Cabin,Jun 6 - 11,485.0,170.0,4.77 (146),4 beds,Jun 6,11,June,11
2,"Cabin in West Farmington, Ohio, US",The Triangle: A-Frame Cabin for your city retreat,Jul 9 - 14,119.0,522.0,4.91 (515),4 beds,Jul 9,14,July,14
3,"Home in Blue Ridge, Georgia, US",*Summer Sizzle* 5 Min to Blue Ridge* Pets* Hot...,Jun 11 - 16,192.0,348.0,4.94 (88),5 beds,Jun 11,16,June,16
4,"Treehouse in Grandview, Texas, US",Luxury Treehouse Couples Getaway w/ Peaceful V...,Jun 4 - 9,232.0,196.0,4.99 (222),1 queen bed,Jun 4,9,June,9

In [35]:
df_clean["Date"]

0      Jun 11 - 16
1       Jun 6 - 11
2       Jul 9 - 14
3      Jun 11 - 16
4        Jun 4 - 9
          ...
828      May 1 - 6
829      May 1 - 6
830      May 1 - 6
882      May 1 - 6
936      May 1 - 6
Name: Date, Length: 166, dtype: object

In [32]:
df_clean.to_datetime(df_clean["Date"])

AttributeError: 'DataFrame' object has no attribute 'to_datetime'